# Home_Work_2
// Напишите программу, проверяющую число, введенное с клавиатуры на четность
#include <iostream>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Russian"); // Корректный вывод русских символов
	int a; // переменной "a" присваивается целочисленный тип 
	cout << "Введите любое число" << endl; // вывод в консоль
	cin >> a; // Ввод значения перменной "a" с клавиатуры
	if (a % 2 == 0) /* Условие Если при делении на 2 остаток равен 0 то выводится
					"Число четное" иначе "Число нечетное" */
	{
		cout << "Число четное" << endl;
	}
	else
	{
		cout << "Число нечетное" << endl;
	}
}
